lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
#include "Arduino.h"

#include <stdint.h>
#include <string.h>

#include "cmsis.h"
#include <nrf54l15.h>

// SAADC register offsets and fields (single-channel helper for Arduino API).
#define SAADC_TASKS_START          0x000UL
#define SAADC_TASKS_SAMPLE         0x004UL
#define SAADC_TASKS_STOP           0x008UL
#define SAADC_TASKS_CALIBRATE      0x00CUL
#define SAADC_EVENTS_STARTED       0x100UL
#define SAADC_EVENTS_END           0x104UL
#define SAADC_EVENTS_CALDONE       0x110UL
#define SAADC_EVENTS_STOPPED       0x114UL
#define SAADC_ENABLE               0x500UL
#define SAADC_CH_PSELP             0x510UL
#define SAADC_CH_PSELN             0x514UL
#define SAADC_CH_CONFIG            0x518UL
#define SAADC_CH_STRIDE            0x10UL
#define SAADC_RESOLUTION           0x5F0UL
#define SAADC_OVERSAMPLE           0x5F4UL
#define SAADC_SAMPLERATE           0x5F8UL
#define SAADC_RESULT_PTR           0x62CUL
#define SAADC_RESULT_MAXCNT        0x630UL
#define SAADC_RESULT_AMOUNT        0x634UL
#define SAADC_NOISESHAPE           0x654UL

#define SAADC_ENABLE_DISABLED      0UL
#define SAADC_ENABLE_ENABLED       1UL

#define SAADC_OVERSAMPLE_BYPASS     0UL
#define SAADC_NOISESHAPE_DISABLED   0UL

// PWM register offsets for analogWrite().
#define PWM_TASKS_STOP                    0x004UL
#define PWM_TASKS_DMA_SEQ_START           0x010UL
#define PWM_EVENTS_STOPPED                0x104UL
#define PWM_EVENTS_SEQSTARTED0            0x108UL
#define PWM_EVENTS_RAMUNDERFLOW           0x120UL
#define PWM_EVENTS_DMA_SEQ0_END           0x124UL
#define PWM_SHORTS                        0x200UL
#define PWM_ENABLE                        0x500UL
#define PWM_MODE                          0x504UL
#define PWM_COUNTERTOP                    0x508UL
#define PWM_PRESCALER                     0x50CUL
#define PWM_DECODER                       0x510UL
#define PWM_LOOP                          0x514UL
#define PWM_IDLEOUT                       0x518UL
#define PWM_SEQ0_REFRESH                  0x528UL
#define PWM_SEQ0_ENDDELAY                 0x52CUL
#define PWM_SEQ1_REFRESH                  0x530UL
#define PWM_SEQ1_ENDDELAY                 0x534UL
#define PWM_PSEL_OUT0                     0x560UL
#define PWM_PSEL_OUT_STRIDE               0x004UL
#define PWM_DMA_SEQ0_PTR                  0x704UL
#define PWM_DMA_SEQ0_MAXCNT               0x708UL
#define PWM_DMA_SEQ_STRIDE                0x024UL
#define PWM_DMA_SEQ1_PTR                  (PWM_DMA_SEQ0_PTR + PWM_DMA_SEQ_STRIDE)
#define PWM_DMA_SEQ1_MAXCNT               (PWM_DMA_SEQ0_MAXCNT + PWM_DMA_SEQ_STRIDE)

#define PWM_ENABLE_DISABLED               0UL
#define PWM_ENABLE_ENABLED                1UL
#define PWM_MODE_UP                       0UL
#define PWM_DECODER_LOAD_INDIVIDUAL       2UL
#define PWM_DECODER_MODE_REFRESHCOUNT     0UL
#define PWM_PSEL_DISCONNECTED             0xFFFFFFFFUL

#define PWM_SHORT_DMA_SEQ0_BUSERROR_STOP  (1UL << 6U)
#define PWM_COMPARE_POLARITY_FALLING_EDGE 0x8000U

#define TIMER_TASKS_START                 0x000UL
#define TIMER_TASKS_STOP                  0x004UL
#define TIMER_TASKS_CLEAR                 0x00CUL
#define TIMER_SUBSCRIBE_START             0x080UL
#define TIMER_SUBSCRIBE_CLEAR             0x08CUL
#define TIMER_EVENTS_COMPARE0             0x140UL
#define TIMER_EVENTS_COMPARE_STRIDE       0x004UL
#define TIMER_SHORTS                      0x200UL
#define TIMER_MODE                        0x504UL
#define TIMER_BITMODE                     0x508UL
#define TIMER_PRESCALER                   0x510UL
#define TIMER_CC0                         0x540UL
#define TIMER_CC_STRIDE                   0x004UL
#define TIMER_PUBLISH_COMPARE0            0x1C0UL
#define TIMER_PUBLISH_COMPARE_STRIDE      0x004UL

#define TIMER_MODE_TIMER                  0UL
#define TIMER_BITMODE_32                  3UL
#define TIMER_SHORT_COMPARE0_CLEAR        (1UL << 0U)

#define GPIOTE_TASKS_OUT0                 0x000UL
#define GPIOTE_TASKS_SET0                 0x030UL
#define GPIOTE_TASKS_CLR0                 0x060UL
#define GPIOTE_SUBSCRIBE_OUT0             0x080UL
#define GPIOTE_SUBSCRIBE_SET0             0x0B0UL
#define GPIOTE_SUBSCRIBE_CLR0             0x0E0UL
#define GPIOTE_CONFIG0                    0x510UL
#define GPIOTE_CONFIG_STRIDE              0x004UL

#define GPIOTE_CONFIG_MODE_TASK           3UL
#define GPIOTE_CONFIG_POLARITY_NONE       0UL
#define GPIOTE_CONFIG_POLARITY_TOGGLE     3UL

#define DPPIC_CHENSET                     0x504UL
#define DPPIC_CHENCLR                     0x508UL

#define ANALOG_PWM_CHANNELS_PER_INSTANCE  4U
#define ANALOG_PWM_INSTANCES              3U
#define ANALOG_PWM_PIN_COUNT              16U
#define ANALOG_TIMER_PWM_SLOT_COUNT       5U
#define ANALOG_TIMER_PWM_SYNC_CHANNEL_OFFSET ANALOG_TIMER_PWM_SLOT_COUNT
#define ANALOG_PWM_INSTANCE_NONE          0xFFU
#define ANALOG_PWM_NO_CHANNEL             0xFFU
#define ANALOG_PWM_NO_PIN                 0xFFU
#define ANALOG_PWM_NO_SLOT                0xFFU
#define ANALOG_PWM_DEFAULT_HZ             1000UL
#define ANALOG_SOFT_PWM_DEFAULT_PERIOD_US 1000UL

extern uint8_t nrf54l15_gpiote20_acquire_task_channel(uint8_t* channel);
extern void nrf54l15_gpiote20_release_task_channel(uint8_t channel);

static uint8_t pwm_instance_any_dynamic_channel(uint8_t instance);
static void pwm_apply_outputs(uint8_t instance);
static void pwm_stop_instance(uint8_t instance);

static inline volatile uint32_t* regptr(uintptr_t base, uintptr_t off)
{
    return (volatile uint32_t*)(base + off);
}

#if defined(NRF54L15_CLEAN_POWER_LOW)
static const uint16_t kSaadcLowPowerSettleUs = 250U;
static const uint16_t kSaadcLowPowerRetrySettleUs = 750U;
static const uint8_t kSaadcLowPowerAttempts = 3U;
#endif
static const uint32_t kSaadcCalibrateSpinLimit = 200000UL;
static const uint32_t kSaadcStartSpinLimit = 200000UL;
static const uint32_t kSaadcSampleSpinLimit = 400000UL;
static const uint32_t kSaadcStopSpinLimit = 200000UL;

static inline uint32_t make_psel(uint8_t port, uint8_t pin)
{
    return ((uint32_t)(pin & 0x1FU) << SAADC_CH_PSELP_PIN_Pos) |
           ((uint32_t)(port & 0x7U) << SAADC_CH_PSELP_PORT_Pos) |
           ((uint32_t)SAADC_CH_PSELP_CONNECT_AnalogInput << SAADC_CH_PSELP_CONNECT_Pos);
}

