lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
static uint8_t timer_pwm_update_pin_live(uint8_t slot,
                                         uint8_t index,
                                         uint8_t prescaler,
                                         uint32_t period_ticks,
                                         uint32_t high_ticks)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT || index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }

    if (g_timer_pwm_slot_owner[slot] != index ||
        g_timer_pwm_slot_gpiote_channel[slot] == ANALOG_PWM_NO_CHANNEL ||
        g_timer_pwm_slot_active[slot] == 0U ||
        g_timer_pwm_slot_prescaler[slot] != prescaler ||
        g_timer_pwm_slot_period_ticks[slot] != period_ticks) {
        return 0U;
    }

    g_timer_pwm_slot_pending_high_ticks[slot] = high_ticks;
    g_timer_pwm_slot_pending_update[slot] = 1U;

    g_pwm_pin_software[index] = 0U;
    g_soft_pwm_on_time_us[index] = 0UL;
    g_soft_pwm_output_high[index] = 1U;
    return 1U;
}

static void timer_pwm_service_pending_updates(void)
{
    for (uint8_t slot = 0U; slot < ANALOG_TIMER_PWM_SLOT_COUNT; ++slot) {
        if (g_timer_pwm_slot_owner[slot] == ANALOG_PWM_NO_PIN) {
            continue;
        }

        const uintptr_t timer_base = k_timer_pwm_base[slot];
        volatile uint32_t* compare0_event = regptr(timer_base, TIMER_EVENTS_COMPARE0);
        volatile uint32_t* compare1_event =
            regptr(timer_base, TIMER_EVENTS_COMPARE0 + TIMER_EVENTS_COMPARE_STRIDE);

        if (*compare1_event != 0U) {
            *compare1_event = 0U;
        }

        if (*compare0_event == 0U) {
            continue;
        }

        *compare0_event = 0U;

        if (g_timer_pwm_slot_pending_update[slot] != 0U) {
            *regptr(timer_base, TIMER_CC0 + TIMER_CC_STRIDE) =
                g_timer_pwm_slot_pending_high_ticks[slot];
            g_timer_pwm_slot_pending_update[slot] = 0U;
        }
    }
}

static void timer_pwm_release_pin(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return;
    }

    const uint8_t slot = g_pwm_pin_timer_slot[index];
    if (slot == ANALOG_PWM_NO_SLOT || slot >= ANALOG_TIMER_PWM_SLOT_COUNT) {
        return;
    }

    const uint8_t gpiote_channel = g_timer_pwm_slot_gpiote_channel[slot];

    timer_pwm_stop_slot(slot);

    if (gpiote_channel != ANALOG_PWM_NO_CHANNEL) {
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_CONFIG0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        nrf54l15_gpiote20_release_task_channel(gpiote_channel);
    }

    g_timer_pwm_slot_gpiote_channel[slot] = ANALOG_PWM_NO_CHANNEL;
    g_timer_pwm_slot_prescaler[slot] = 0U;
    g_timer_pwm_slot_period_ticks[slot] = 0UL;
    g_timer_pwm_slot_pending_high_ticks[slot] = 0UL;
    g_timer_pwm_slot_pending_update[slot] = 0U;
    g_timer_pwm_slot_active[slot] = 0U;
    g_timer_pwm_slot_owner[slot] = ANALOG_PWM_NO_PIN;
    g_pwm_pin_timer_slot[index] = ANALOG_PWM_NO_SLOT;
}

static uint8_t timer_pwm_apply_pin(uint8_t index)
{
    uint8_t port = 0U;
    uint8_t pin = 0U;
    if (index >= ANALOG_PWM_PIN_COUNT ||
        pwm_pin_supports_timer_output(index) == 0U ||
        pwm_pin_requests_custom_frequency(index) == 0U) {
        return 0U;
    }

    const uint32_t pulse = g_pwm_pin_pulse[index];
    if (pulse == 0UL || pulse >= (uint32_t)g_pwm_countertop) {
        return 0U;
    }

    uint8_t slot = ANALOG_PWM_NO_SLOT;
    if (timer_pwm_ensure_slot(index, &slot) == 0U) {
        return 0U;
    }

    const uint8_t gpiote_channel = g_timer_pwm_slot_gpiote_channel[slot];
    if (gpiote_channel == ANALOG_PWM_NO_CHANNEL) {
        timer_pwm_release_pin(index);
        return 0U;
    }
    if (resolve_pwm_gpio(index, &port, &pin) == 0U) {
        timer_pwm_release_pin(index);
        return 0U;
    }

    uint8_t prescaler = 0U;
    uint32_t period_ticks = 0U;
    if (timer_pwm_compute_timing(pwm_pin_effective_frequency_hz(index),
                                 &prescaler,
                                 &period_ticks) == 0U) {
        timer_pwm_release_pin(index);
        return 0U;
    }

    uint32_t high_ticks =
        (pulse * period_ticks + (uint32_t)(g_pwm_countertop / 2U)) / (uint32_t)g_pwm_countertop;
    if (high_ticks == 0UL) {
        high_ticks = 1UL;
    } else if (high_ticks >= period_ticks) {
        high_ticks = period_ticks - 1UL;
    }

    const uint8_t dppi_channel = timer_pwm_slot_dppi_channel(slot);
    const uint8_t sync_dppi_channel = timer_pwm_slot_sync_dppi_channel(slot);
    const uintptr_t timer_base = k_timer_pwm_base[slot];
    const uintptr_t gpiote_cfg =
        GPIOTE_CONFIG0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE);
    const uintptr_t gpiote_sub_out =
        GPIOTE_SUBSCRIBE_OUT0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE);

    if (timer_pwm_update_pin_live(slot, index, prescaler, period_ticks, high_ticks) != 0U) {
        return 1U;
    }

    *regptr(timer_base, TIMER_TASKS_STOP) = 1U;
    *regptr(k_timer_pwm_dppic_base, DPPIC_CHENCLR) =
        (1UL << dppi_channel) | (1UL << sync_dppi_channel);
    *regptr(timer_base, TIMER_SUBSCRIBE_START) = 0U;
    *regptr(timer_base, TIMER_SUBSCRIBE_CLEAR) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + TIMER_PUBLISH_COMPARE_STRIDE) = 0U;
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + (2UL * TIMER_PUBLISH_COMPARE_STRIDE)) = 0U;
    *regptr(k_timer_pwm_gpiote_base, gpiote_sub_out) = 0U;

    uint32_t gpiote_config = 0U;
    gpiote_config |= (GPIOTE_CONFIG_MODE_TASK << GPIOTE_CONFIG_MODE_Pos);
    gpiote_config |= ((uint32_t)(pin & 0x1FU) << GPIOTE_CONFIG_PSEL_Pos);
    gpiote_config |= ((uint32_t)(port & 0x7U) << GPIOTE_CONFIG_PORT_Pos);
    gpiote_config |= (GPIOTE_CONFIG_POLARITY_TOGGLE << GPIOTE_CONFIG_POLARITY_Pos);
    gpiote_config |= (1UL << GPIOTE_CONFIG_OUTINIT_Pos);
    *regptr(k_timer_pwm_gpiote_base, gpiote_cfg) = gpiote_config;

    *regptr(timer_base, TIMER_TASKS_CLEAR) = 1U;
    *regptr(timer_base, TIMER_MODE) = TIMER_MODE_TIMER;
    *regptr(timer_base, TIMER_BITMODE) = TIMER_BITMODE_32;
    *regptr(timer_base, TIMER_PRESCALER) = (uint32_t)prescaler;
    *regptr(timer_base, TIMER_SHORTS) = TIMER_SHORT_COMPARE0_CLEAR;
    *regptr(timer_base, TIMER_CC0) = period_ticks;
    *regptr(timer_base, TIMER_CC0 + TIMER_CC_STRIDE) = high_ticks;
    *regptr(timer_base, TIMER_CC0 + (2UL * TIMER_CC_STRIDE)) = period_ticks;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0) = 0U;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0 + TIMER_EVENTS_COMPARE_STRIDE) = 0U;
    *regptr(timer_base, TIMER_EVENTS_COMPARE0 + (2UL * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;

    *regptr(timer_base, TIMER_PUBLISH_COMPARE0) = dppi_config_value(dppi_channel);
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + TIMER_PUBLISH_COMPARE_STRIDE) =
        dppi_config_value(dppi_channel);
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0 + (2UL * TIMER_PUBLISH_COMPARE_STRIDE)) =
        dppi_config_value(sync_dppi_channel);
    *regptr(k_timer_pwm_gpiote_base, gpiote_sub_out) = dppi_config_value(dppi_channel);
    *regptr(k_timer_pwm_dppic_base, DPPIC_CHENSET) =
        (1UL << dppi_channel) | (1UL << sync_dppi_channel);

    g_timer_pwm_slot_prescaler[slot] = prescaler;
    g_timer_pwm_slot_period_ticks[slot] = period_ticks;
    g_timer_pwm_slot_pending_high_ticks[slot] = high_ticks;
    g_timer_pwm_slot_pending_update[slot] = 0U;
    g_pwm_pin_software[index] = 0U;
    g_soft_pwm_on_time_us[index] = 0UL;
    g_soft_pwm_output_high[index] = 1U;

    const uint8_t sync_leader = timer_pwm_find_sync_leader(slot, prescaler, period_ticks);
    if (sync_leader != ANALOG_PWM_NO_SLOT) {
        *regptr(timer_base, TIMER_SUBSCRIBE_START) =
            dppi_config_value(timer_pwm_slot_sync_dppi_channel(sync_leader));
    } else {
        *regptr(timer_base, TIMER_TASKS_START) = 1U;
    }
    g_timer_pwm_slot_active[slot] = 1U;

